Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook 
for the following questions.

In [1]:
import sqlite3
import pandas as pd

In [2]:
try:
    con = sqlite3.connect('sqlite_db_pythonsqlite.db')
    con.row_factory = sqlite3.Row
    cursor = con.cursor()
except Error as e:
    print(e)

In [3]:
query = 'SELECT * FROM Bookings'

cursor.execute(query)

row = cursor.fetchone()
names = row.keys()

results = pd.DataFrame(cursor.fetchall())
results.columns = names
print(results)

      bookid  facid  memid            starttime  slots
0          1      4      1  2012-07-03 08:00:00      2
1          2      6      0  2012-07-03 18:00:00      2
2          3      7      1  2012-07-03 19:00:00      2
3          4      8      1  2012-07-03 10:00:00      1
4          5      8      1  2012-07-03 15:00:00      1
...      ...    ...    ...                  ...    ...
4037    4038      8     29  2012-09-30 16:30:00      2
4038    4039      8     29  2012-09-30 18:00:00      1
4039    4040      8     21  2012-09-30 18:30:00      1
4040    4041      8     16  2012-09-30 19:00:00      1
4041    4042      8     29  2012-09-30 19:30:00      1

[4042 rows x 5 columns]

/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

In [4]:
query10 = "SELECT sub.name, \
    (m.firstname || ' ' || m.surname) AS fullname, \
    sub.cost \
FROM Members AS m \
INNER JOIN ( \
    SELECT \
    	b.memid, \
    	f.name, \
        CASE WHEN b.memid = 0 THEN f.guestcost * b.slots \
        ELSE f.membercost * b.slots END AS cost \
    FROM Bookings AS b \
    INNER JOIN Facilities AS f \
    ON b.facid = f.facid \
    WHERE b.starttime LIKE '2012-09-14%') AS sub \
ON m.memid = sub.memid \
WHERE sub.cost > 30 \
ORDER BY sub.cost DESC;"

cursor.execute(query10)

row = cursor.fetchone()
names = row.keys()

results10 = pd.DataFrame(cursor.fetchall())
results10.columns = names
print(results10)

              name        fullname   cost
0   Massage Room 1     GUEST GUEST  160.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Tennis Court 2     GUEST GUEST  150.0
4   Tennis Court 1     GUEST GUEST   75.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 2     GUEST GUEST   75.0
7     Squash Court     GUEST GUEST   70.0
8   Massage Room 1  Jemima Farrell   39.6
9     Squash Court     GUEST GUEST   35.0
10    Squash Court     GUEST GUEST   35.0

/* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */

In [5]:
query11 = "SELECT m1.surname, m1.firstname, (m2.surname || ', ' || m2.firstname) AS recommender \
    FROM Members AS m1 \
    INNER JOIN Members AS m2 \
    ON m1.recommendedby = m2.memid \
    WHERE m1.recommendedby IS NOT NULL \
    ORDER BY m1.surname, m1. firstname;"

cursor.execute(query11)

row = cursor.fetchone()
names = row.keys()

results11 = pd.DataFrame(cursor.fetchall())
results11.columns = names
print(results11)

              surname  firstname         recommender
0               Baker       Anne    Stibbons, Ponder
1               Baker    Timothy     Farrell, Jemima
2              Boothe        Tim         Rownam, Tim
3             Butters     Gerald       Smith, Darren
4              Coplin       Joan      Baker, Timothy
5             Crumpet      Erica        Smith, Tracy
6                Dare      Nancy    Joplette, Janice
7             Genting    Matthew     Butters, Gerald
8                Hunt       John  Purview, Millicent
9               Jones      David    Joplette, Janice
10              Jones    Douglas        Jones, David
11           Joplette     Janice       Smith, Darren
12          Mackenzie       Anna       Smith, Darren
13               Owen    Charles       Smith, Darren
14             Pinker      David     Farrell, Jemima
15            Purview  Millicent        Smith, Tracy
16             Rumney  Henrietta    Genting, Matthew
17             Sarwin  Ramnaresh     Bader, Florence
18              Smith       Jack       Smith, Darren
19           Stibbons     Ponder       Tracy, Burton
20  Worthington-Smyth      Henry        Smith, Tracy

/* Q12: Find the facilities with their usage by member, but not guests */

In [6]:
query12 = "SELECT f.name, (m.surname || ', ' || m.firstname) AS member, SUM(b.slots/2.0) AS hours_used \
    FROM Facilities AS f \
    INNER JOIN Bookings AS b \
    ON f.facid = b.facid \
    INNER JOIN Members AS m \
    ON b.memid = m.memid \
    WHERE m.memid != 0 \
    GROUP BY f.name, member \
    ORDER BY hours_used DESC;"

cursor.execute(query12)

row = cursor.fetchone()
names = row.keys()

results12 = pd.DataFrame(cursor.fetchall())
results12.columns = names
print(results12)

               name           member  hours_used
0        Pool Table      Rownam, Tim       141.0
1    Massage Room 1      Rownam, Tim        88.0
2    Tennis Court 1  Butters, Gerald        85.5
3    Tennis Court 2      Boothe, Tim        84.0
4      Table Tennis      Rownam, Tim        75.0
..              ...              ...         ...
196    Table Tennis      Baker, Anne         1.0
197    Table Tennis  Butters, Gerald         1.0
198    Table Tennis       Hunt, John         1.0
199      Pool Table  Farrell, Jemima         0.5
200      Pool Table    Owen, Charles         0.5

[201 rows x 3 columns]

/* Q13: Find the facilities usage by month, but not guests */

In [7]:
query12 = "SELECT f.name, SUBSTRING(b.starttime,6,2) AS month, SUM(b.slots/2.0) AS hours_used \
    FROM Facilities AS f \
    INNER JOIN Bookings AS b \
    ON f.facid = b.facid \
    INNER JOIN Members AS m \
    ON b.memid = m.memid \
    WHERE m.memid != 0 \
    GROUP BY f.name, month \
    ORDER BY hours_used DESC;"

cursor.execute(query12)

row = cursor.fetchone()
names = row.keys()

results12 = pd.DataFrame(cursor.fetchall())
results12.columns = names
print(results12)

               name month  hours_used
0        Pool Table    09       221.5
1    Tennis Court 1    09       208.5
2   Badminton Court    08       207.0
3    Tennis Court 2    09       207.0
4     Snooker Table    09       202.0
5    Massage Room 1    09       201.0
6      Table Tennis    09       200.0
7    Tennis Court 2    08       172.5
8    Tennis Court 1    08       169.5
9    Massage Room 1    08       158.0
10    Snooker Table    08       158.0
11       Pool Table    08       151.5
12     Table Tennis    08       148.0
13   Tennis Court 1    07       100.5
14     Squash Court    08        92.0
15     Squash Court    09        92.0
16   Massage Room 1    07        83.0
17  Badminton Court    07        82.5
18    Snooker Table    07        70.0
19   Tennis Court 2    07        61.5
20       Pool Table    07        55.0
21     Table Tennis    07        49.0
22     Squash Court    07        25.0
23   Massage Room 2    09        14.0
24   Massage Room 2    08         9.0
25   Massage Room 2    07         4.0

In [8]:
cursor.close()

In [9]:
con.close()